HengeLiu/RealtimeAgent/legacy/openaiglass-sdk/glass-esp32/sdkconfig.defaults.official_aec_test
# 独立 ESP-SR 官方 AEC 试验入口。
# 使用方式：
# uv run openaiglass.glass.start --sdkconfig-defaults openaiglass-sdk/glass-esp32/sdkconfig.defaults.official_aec_test
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_MODEL_IN_FLASH=y
CONFIG_USE_AFE=y
CONFIG_AFE_INTERFACE_V1=y
CONFIG_USE_WAKENET=y
CONFIG_SR_WN_WN9_HILEXIN=y

CONFIG_GLASS_ENABLE_OFFICIAL_AEC_TEST_APP=y
CONFIG_GLASS_ENABLE_WAKENET_TEST_APP=n
CONFIG_GLASS_AEC_TEST_FILTER_LENGTH=4
CONFIG_GLASS_AEC_TEST_MODE_SR_LOW_COST=y
CONFIG_GLASS_AEC_TEST_PLAYBACK_GAIN_PERMILLE=500
